/*
 * lab4
 *
 *    19. Имеется  сеть  автомобильных  дорог.  Для каждой дороги
 * известна максимальная масса груза, которую можно  провезти  по 
 * этой   дороге.   С   помощью  алгоритма  Дейкстры   определить 
 * максимальный   груз,   который  можно  провезти  между   двумя 
 * указанными городам (10).

 * Выполнил:
 * Хафизов Булат, ПС-21
 *
 * Среда выполнения: cmake, g++
 * Сборка проекта: в корневой директории выполнить команды:
 *   cmake -G "MSYS Makefiles" .
 *   cmake --build .
 * (вместо последней команды можно просто make)
 * Убедиться, что присутствует cmake, MinGW, MSYS и компилятор g++.
 */

#include "common_inc.h"
#include "InputProvider.h"
#include "GraphParser.h"
#include "MaxWeightFinder.h"

int main(int argc, char** argv)
{
}
